import img1 from "../assets/images/landingImage.png"
const Home = () => {
    return (
        <>
            <div className="flex items-center max-sm:flex-col-reverse">
                <div>
                    {/* <h3 className="text-2xl font-bold leading-[1] mb-4 text-green-500">
                        الإسلام دين السلام والوئام والتعايش ، فهو يعلمنا أن نتعايش بسلام وود ومحبة، وأن نحترم الآخرين ونقدر حقوقهم.
                    </h3>
                    <h5>
                        يا رَبَّنَا اغفِرْ لَنَا وَارْحَمْنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ نَحْنُ عِبَادُكَ الْمُذْنِبُونَ، وَأَنْتَ اللَّهُ الْعَظِيمُ الْحَلِيمُ فَارْحَمْنَا بِرَحْمَتِكَ الْوَاسِعَةِ، وَاغْفِرْ لَنَا ذُنُوبَنَا الْكَثِيرَةِ وَاهْدِنَا صِرَاطًا مُسْتَقِيمًا، يَسِّرْ لَنَا طَرِيقَ الْهُدَى وَالْإِيمَانِ وَاجْعَلْنَا مِنَ الَّذِينَ تَغْفِرُ لَهُمْ، وَتُدْخِلُهُمْ جَنَّاتِ النَّعِيمِ
                    </h5> */}
                </div>
                <img src={img1} className="max-w-[350px]" alt="" />
            </div>
        </>
    )
}

export default Home