import { motion } from "framer-motion"
import { useMemo } from "react"
import { ZekrItem } from "./Azkar"


const Sebha = () => {
    const tasabeh = useMemo(() => {
        return [
            {
                id: 1,
                dhikr: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
                reward: "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
                max: 100
            },
            {
                id: 2,
                dhikr: "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ",
                reward: "تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.",
                max: 100
            },
            {
                id: 3,
                dhikr: "سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ",
                reward: "غرست له نخلة في الجنة (أى عدد).",
                max: 100
            },
            {
                id: 4,
                dhikr: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
                reward: "ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).",
                max: 100
            },
            {
                id: 5,
                dhikr: "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.",
                reward: "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
                max: 100
            },
            {
                id: 6,
                dhikr: "لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ",
                reward: "كنز من كنوز الجنة (أى عدد).",
                max: 100
            },
            {
                id: 7,
                dhikr: "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ",
                reward: "تملأ ميزان العبد بالحسنات.",
                max: 100
            },
            {
                id: 8,
                dhikr: "الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد",
                reward: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
                max: 100
            },
            {
                id: 9,
                dhikr: "أستغفر الله",
                reward: "لفعل الرسول صلى الله عليه وسلم.",
                max: 100
            },
            {
                id: 10,
                dhikr: "سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ",
                reward: "أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.",
                max: 100
            },
            {
                id: 11,
                dhikr: "لَا إِلَهَ إِلَّا اللَّهُ",
                reward: "أفضل الذكر لا إله إلاّ الله.",
                max: 100
            },
            {
                id: 12,
                dhikr: "الْلَّهُ أَكْبَرُ",
                reward: "من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.",
                max: 100
            },
            {
                id: 13,
                dhikr: "سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي.",
                reward: "خير الدنيا والآخرة",
                max: 100
            },
            {
                id: 14,
                dhikr: "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ.",
                reward: "قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏\"‏لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا\"‏.",
                max: 100
            },
            {
                id: 15,
                dhikr: "اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا.",
                reward: "قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ\".",
                max: 100
            },
            {
                id: 16,
                dhikr: "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
                reward: "في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).",
                max: 100
            }
        ]
    }, [])
    return (
        <>
            <section className="p-3">
                {tasabeh.map(({ dhikr, id, reward, max }) => (
                    <>
                        <ZekrItem handlingClickFN={() => navigator.vibrate(100)
                        }  id={id * 10} count={max} text={dhikr} key={id} />
                        <section style={{ fontSize: localStorage.getItem("font_size") + "px", }} className="p-3 border-r-solid border-r-orange-400 border-b-solid border-b-2 border-b-orange-400 bg-background border-r-[7px] leading-[1.5] rounded-lg mt-10 mb-5">
                            {reward}
                        </section>
                    </>
                ))}
            </section>
        </>
    )
}

export default Sebha